Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/redirects/Resources/Private/Language/*.locallang.xlf
Languages: de

# redirects
source: Redirect Settings
de: Weiterleitungseinstellungen

# redirects.autoUpdateSlugs
source: Update the slugs of all sub pages automatically
de: Aktualisiere die URL-Segmente aller Unterseiten automatisch

# redirects.autoCreateRedirects
source: Create redirects for pages with a new slug automatically
de: Weiterleitungen für Seiten mit einem neuen URL-Segment automatisch erstellen

# redirects.redirectTTL
source: Time To Live of redirect records in days
de: Lebenszeit für Weiterleitungen in Tagen

# redirects.httpStatusCode
source: HTTP Status Code for the redirect, 301 is the default
de: HTTP-Status-Code für die Weiterleitung, 301 ist die Standardeinstellung

# cleanupRedirectsCommand.label.days
source: Cleanup redirects older than provided number of days
de: Weiterleitungen werden bereinigt, wenn sie älter als die angegebene Anzahl von Tagen sind

# cleanupRedirectsCommand.label.domain
source: Cleanup redirects matching provided domain(s)
de: Weiterleitungen werden bereinigt, wenn sie mit der/den angegebenen Domain(s) übereinstimmen

# cleanupRedirectsCommand.label.hitCount
source: Cleanup redirects matching hit counts lower than given number
de: Weiterleitungen werden bereinigt, wenn sie weniger als die angegebene Zahl verwendet werden

# cleanupRedirectsCommand.label.path
source: Cleanup redirects matching given path (as database like expression)>
de: Weiterleitungen werden bereinigt, wenn sie mit dem angegebenen Pfad übereinstimmen (als Datenbankanfrage)>

# cleanupRedirectsCommand.label.statusCode
source: Cleanup redirects matching provided status code(s)
de: Umleitungen werden bereinigt, wenn sie mit dem/den angegebenen Status Code(s) übereinstimmen
