Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_pagetsconfig.xlf
Languages: de

# module.pagetsconfig.description
source: The page TSconfig module lets you manage configuration overrides for editors and option display throughout the Backend.
de: Mit dem Page TSconfig Modul können Sie Konfigurationsüberschreibungen für Redakteure und die Anzeige von Optionen im gesamten Backend verwalten.

# module.pagetsconfig.noAccess
source: Access to this module denied.
de: Zugriff auf dieses Modul verweigert.

# module.pagetsconfig_pages
source: Pages containing page TSconfig
de: Seiten, die Page TSconfig enthalten

# module.pagetsconfig_pages.headline
source: Pages containing page TSconfig
de: Seiten, die Page TSconfig enthalten

# module.pagetsconfig_pages.description
source: Global overview of all pages in the database containing page TSconfig.
de: Globale Übersicht aller Seiten in der Datenbank, die benutzerdefiniertes Page TSconfig enthalten.

# module.pagetsconfig_pages.noRecords
source: There are no pages containing page TSconfig settings in the page configuration.
de: Es gibt keine Seiten mit Page TSconfig-Einstellungen in der Seitenkonfiguration.

# module.pagetsconfig_pages.pagetitle
source: Page title
de: Seitentitel

# module.pagetsconfig_pages.written_tsconfig_lines
source: Number of lines of code in field "TSconfig"
de: Anzahl der Codezeilen im Feld "TSconfig"

# module.pagetsconfig_active
source: Active page TSconfig
de: Aktive Page TSconfig

# module.pagetsconfig_active.headline
source: Active page TSconfig of page "%s"
de: Aktive Page TSconfig auf Seite "%s"

# module.pagetsconfig_active.description
source: Overview of the current page TSconfig of the system. A targeted search for values and names is possible. The list of results can also be filtered according to conditions.
de: Übersicht des aktuell geladenen Page TSconfig dieses Systems. Eine gezielte Suche nach Werten und Namen ist möglich. Die Ergebnisliste kann auch nach Bedingungen gefiltert werden.

# module.pagetsconfig_active.displayConstantSubstitutions
source: Substitute constants in page TSconfig
de: Konstanten in Page TSconfig ersetzen

# module.pagetsconfig_active.displayComments
source: Display comments
de: Kommentare anzeigen

# module.pagetsconfig_active.sortAlphabetically
source: Sort keys alphabetically
de: Schlüssel alphabetisch sortieren

# module.pagetsconfig_active.panel.header.conditions
source: Conditions
de: Bedingungen

# module.pagetsconfig_active.panel.header.numberOfSearchMatches
source: %s search match(es)
de: %s Suchergebnis(se)

# module.pagetsconfig_active.panel.info.conditionActiveCount.multiple
source: %s active conditions
de: %s aktive Bedingungen

# module.pagetsconfig_active.panel.info.conditionActiveCount.single
source: %s active condition
de: %s aktive Bedingung

# module.pagetsconfig_active.panel.info.conditionWithConstant
source: Site settings usage: [%s]
de: Site Settings Nutzung: [%s]

# module.pagetsconfig_active.panel.header.configuration
source: Configuration
de: Konfiguration

# module.pagetsconfig_active.siteSettings
source: Constants from site settings
de: Konstanten aus der Site-Konfiguration

# module.pagetsconfig_active.noPageTSconfigAvailable
source: No suitable page TSconfig available.
de: Keine passende Page TSconfig verfügbar.

# module.pagetsconfig_active.tree.valueWithConstant
source: Constant usage: [%s]
de: Konstanten-Nutzung: [%s]

# module.pagetsconfig_includes
source: Included page TSconfig
de: Eingebundene Page TSconfig

# module.pagetsconfig_includes.headline
source: Included page TSconfig of page "%s"
de: Eingebundene Page TSconfig auf der Seite "%s"

# module.pagetsconfig_includes.description
source: Overview of the included TypoScript and include order for the current page.
de: Übersicht eingebundener TypoScript Datensätze sowie deren Ladereihenfolge für die aktuell ausgewählte Seite.

# module.pagetsconfig_includes.siteSettings
source: Constants from site settings
de: Konstanten aus Site-Konfiguration

# module.pagetsconfig_includes.panel.header.configuration
source: Configuration
de: Konfiguration

# module.pagetsconfig_includes.panel.header.syntaxErrors
source: Syntax scanner warnings
de: Warnungen des Syntax-Scanner

# module.pagetsconfig_includes.panel.header.conditions
source: Conditions
de: Bedingungen

# module.pagetsconfig_includes.panel.info.syntaxErrorCount.single
source: %s syntax warning
de: %s Syntax-Warnung

# module.pagetsconfig_includes.panel.info.syntaxErrorCount.multiple
source: %s syntax warnings
de: %s Syntax-Warnungen

# module.pagetsconfig_includes.panel.info.conditionActiveCount.multiple
source: %s active conditions
de: %s aktive Bedingungen

# module.pagetsconfig_includes.panel.info.conditionActiveCount.single
source: %s active condition
de: %s aktive Bedingung

# module.pagetsconfig_includes.panel.info.conditionWithConstant
source: Constant usage: [%s]
de: Konstanten-Nutzung: [%s]

# module.pagetsconfig_includes.syntaxError.sourceCode
source: Show affected code snippet
de: Zeige betroffenes Code-Snippet

# module.pagetsconfig_includes.syntaxError.type.line.invalid
source: Invalid line in "%1$s", line number "%2$s"
de: Ungültige Zeile in "%1$s", Zeilennummer "%2$s"

# module.pagetsconfig_includes.syntaxError.type.brace.excess
source: Brace in excess in "%1$s", line number "%2$s"
de: Klammer zu viel in "%1$s", Zeilennummer "%2$s"

# module.pagetsconfig_includes.syntaxError.type.brace.missing
source: Brace missing in "%1$s", line number "%2$s"
de: Klammer fehlt in "%1$s", Zeilennummer "%2$s"

# module.pagetsconfig_includes.syntaxError.type.import.empty
source: Import does not find a file in "%1$s", line number "%2$s"
de: Der Import findet keine Datei in "%1$s", Zeile "%2$s"

# module.pagetsconfig_includes.tree.child.type.AtImport
source: Included via "@import"
de: Eingebunden via "@import"

# module.pagetsconfig_includes.tree.child.type.Condition
source: Condition (then)
de: Bedingung (then)

# module.pagetsconfig_includes.tree.child.type.ConditionElse
source: Condition (else)
de: Bedingung (else)

# module.pagetsconfig_includes.tree.child.type.ConditionIncludeTyposcript
source: Included via "INCLUDE_TYPOSCRIPT" (with condition)
de: Eingebunden via "INCLUDE_TYPOSPOSCRIPT" (mit Bedingung)

# module.pagetsconfig_includes.tree.child.type.IncludeTyposcript
source: Included via "INCLUDE_TYPOSCRIPT"
de: Eingebunden via "INCLUDE_TYPOSCRIPT"

# module.pagetsconfig_includes.tree.child.conditionVerdict.matched
source: Matched
de: Übereinstimmung

# module.pagetsconfig_includes.tree.child.conditionVerdict.notMatched
source: Not matched
de: Keine Übereinstimmung

# module.pagetsconfig_includes.tree.child.btn.sourceCode
source: Show code
de: Code anzeigen

# module.pagetsconfig_includes.tree.child.btn.sourceCodeWithResolvedIncludes
source: Show code including possible includes/imports
de: Code inklusive möglicher Einbindungen/Importe anzeigen
