Repository: oliverklee/TYPO3-testing-distribution
Catalog: src/extensions/slub-structured-content/Resources/Private/Language/*.locallang.xlf
Languages: de

# plugin.room_index
source: Room list
de: Raumliste

# plugin.room_index_description
source: Create Room list
de: Raumliste anlegen

# content_group.slubstructuredcontent
source: SLUB Structured Content
de: SLUB Strukturierte Inhalte

# plugin.room.heading
source: Room list
de: Raumliste

# plugin.room.property.title
source: Room
de: Raum

# plugin.room.property.noise
source: Noise level
de: Ger채uschpegel

# plugin.room.property.daylight
source: Light conditions
de: Lichtverh채ltnisse

# plugin.room.show.properties
source: Properties
de: Eigenschaften

# plugin.room.show.link
source: Link to the room
de: Link zum Raum

# plugin.room.show.noise.true
source: Noisy
de: Ger채uschvoll

# plugin.room.show.noise.false
source: Quiet
de: Ger채uscharm

# plugin.room.show.daylight.true
source: Daylight
de: Tageslicht

# plugin.room.show.daylight.false
source: Artificial light only
de: Nur Kunstlicht
