Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/form/Resources/Private/Language/*.locallang.xlf
Languages: de

# element.ImageUpload.properties.SummaryPage.altText
source: Uploaded image
de: Hochgeladenes Bild

# element.DatePicker.properties.timeSelectorHourLabel
source: Hour
de: Stunde

# validation.error.1221560910
source: This field is mandatory.
de: Das ist ein Pflichtfeld.

# validation.error.1221560718
source: This field is mandatory.
de: Das ist ein Pflichtfeld.

# validation.error.1347992400
source: This field is mandatory.
de: Das ist ein Pflichtfeld.

# validation.error.1347992453
source: This field is mandatory.
de: Das ist ein Pflichtfeld.

# validation.error.1238087674
source: You must enter a valid date.
de: Bitte geben Sie ein gültiges Datum ein.

# validation.error.1221551320
source: You can only enter letters or digits.
de: Bitte geben Sie Buchstaben oder Ziffern ein.

# validation.error.1221565786
source: You can only enter non formatted text without any markup (e.g without XML tags).
de: Sie können nur nicht-formatierten Text ohne Markup eingeben (z.B. ohne XML-Tags).

# validation.error.1238110957
source: You can only enter non formatted text without any markup (e.g without XML tags).
de: Sie können nur nicht-formatierten Text ohne Markup eingeben (z.B. ohne XML-Tags).

# validation.error.1269883975
source: You can only enter non formatted text without any markup (e.g without XML tags).
de: Sie können nur nicht-formatierten Text ohne Markup eingeben (z.B. ohne XML-Tags).

# validation.error.1428504122
source: Your text must be a minimum of %s characters in length and no longer than %s.
de: Ihr Text muss mindestens %s Zeichen lang sein und darf nicht länger als %s sein.

# validation.error.1238108068
source: You must enter text which is longer than %s characters.
de: Sie müssen Text eingeben, der länger als %s Zeichen ist.

# validation.error.1238108069
source: You must enter text which is no longer than %s characters.
de: Sie müssen Text eingeben, der nicht länger als %s Zeichen ist.

# validation.error.1221559976
source: You must enter a valid email address.
de: Sie müssen eine gültige E-Mail-Adresse eingeben.

# validation.error.1221560494
source: You must enter a valid number.
de: Sie müssen eine gültige Zahl eingeben.

# validation.error.1221560288
source: You must enter a valid floating point number.
de: Sie müssen eine gültige Gleitkommazahl eingeben.

# validation.error.1221563685
source: You must enter a valid number.
de: Sie müssen eine gültige Zahl eingeben.

# validation.error.1221561046
source: You must enter a valid number between %s and %s.
de: Sie müssen eine gültige Zahl zwischen %s und %s eingeben.

# validation.error.1221565130
source: You must enter a valid value. Please refer to the description of this field.
de: Sie müssen einen gültigen Wert eingeben. Bitte beachten Sie die Beschreibung dieses Feldes.

# validation.error.1475002976
source: You must enter a countable subject.
de: Bitte geben Sie ein Element ein, das gezählt werden kann.

# validation.error.1475002994
source: You must select between %s to %s elements.
de: Bitte geben Sie eine gültige Zahl zwischen %s und %s ein.

# validation.error.1471708997
source: You must enter an instance of \TYPO3\CMS\Extbase\Domain\Model\FileReference or \TYPO3\CMS\Core\Resource\File.
de: Sie müssen eine Instanz von \TYPO3\CMS\Extbase\Domain\Model\FileReference oder \TYPO3\CMS\Core\Resource\File angeben.

# validation.error.1471708998
source: You entered an incorrect media type, "%s" is not allowed for this file. Please refer to the description of this field.
de: Sie haben einen falschen Medientyp eingegeben, "%s" ist für diese Datei nicht zulässig. Bitte beachten Sie die Beschreibung dieses Feldes.

# validation.error.1613126216
source: The file extension provided "%s" does not match to expected media types. Please refer to the description of this field.
de: Die angegebene Dateiendung "%s" stimmt nicht mit den erwarteten Medientypen überein. Bitte beachten Sie die Beschreibung dieses Feldes.

# validation.error.1476396435
source: You must NOT fill this field.
de: Sie dürfen dieses Feld NICHT ausfüllen.

# validation.error.1505303626
source: You must enter an instance of \TYPO3\CMS\Extbase\Domain\Model\FileReference or \TYPO3\CMS\Core\Resource\File.
de: Sie müssen eine Instanz von \TYPO3\CMS\Extbase\Domain\Model\FileReference oder \TYPO3\CMS\Core\Resource\File angeben.

# validation.error.1505305752
source: You must select a file that is larger than %s in size.
de: Sie müssen eine Datei auswählen, die größer als %s ist.

# validation.error.1505305753
source: You must select a file that is no larger than %s.
de: Sie müssen eine Datei auswählen, die nicht größer als %s ist.

# validation.error.1521293685
source: You must enter an instance of \DateTime.
de: Sie müssen ein Objekt vom Typ \DateTime eingeben.

# validation.error.1521293686
source: You must select a date before %s.
de: Sie müssen ein Datum vor dem %s wählen.

# validation.error.1521293687
source: You must select a date after %s.
de: Sie müssen ein Datum nach dem %s wählen.

# validation.error.1556283177
source: Password does not match confirmation
de: Die beiden Passworteingaben sind nicht gleich

# form_new_wizard_title
source: Form
de: Formular

# form_new_wizard_description
source: A form that allows website users to submit messages.
de: Ein Formular, das Benutzern die Übermittlung einer Meldung ermöglicht.

# upload.error.150530345
source: Maximum file size exceeded.
de: Maximale Dateigröße überschritten.

# upload.error.150530346
source: Upload failed. The file was only partially uploaded, please try again.
de: Fehler beim Hochladen. Die Datei wurde nur teilweise hochgeladen, bitte versuchen Sie es erneut.

# upload.error.150530347
source: No file was uploaded.
de: Keine Datei wurde hochgeladen.

# upload.error.150530348
source: Upload failed.
de: Das Hochladen ist fehlgeschlagen

# form.configuration.module.provider
source: Form: YAML Configuration
de: Formular: YAML-Konfiguration

# pagination.previous
source: Previous
de: Vorherige Seite

# pagination.next
source: Next
de: Nächste Seite

# pagination.first
source: First
de: Erste Seite

# pagination.last
source: Last
de: Letzte Seite

# pagination.forms
source: Forms
de: Formulare

# pagination.page
source: Page
de: Seite

# pagination.refresh
source: Refresh
de: Aktualisieren
