Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/lowlevel/Resources/Private/Language/*.locallang.xlf
Languages: de

# module.configuration.title
source: Configuration
de: Konfiguration

# module.configuration.shortDescription
source: View configuration from localconf.php and tables.php
de: Konfiguration von localconf.php und tables.php anzeigen

# module.configuration.description
source: Allows you to browse the values of the $TCA array (table configuration) and $TYPO3_CONF_VARS. You cannot set any values, only browse them.
de: Ermöglicht das Durchsuchen der Werte des Arrays $TCA (Tabellenkonfiguration) und $TYPO3_CONF_VARS. Du kannst keine Werte festlegen, sondern sie nur durchsuchen.

# module.configuration.numberOfSearchMatches
source: %s search match(es)
de: %s Suchergebnis(se)

# moduleMenu.dropdown.label
source: Configuration to show
de: anzuzeigende Konfiguration

# configuration.headline
source: Configuration of "%1s"
de: Konfiguration von "%1s"

# typo3ConfVars
source: $GLOBALS['TYPO3_CONF_VARS'] (Global Configuration)
de: $GLOBALS['TYPO3_CONF_VARS'] (Globale Konfiguration)

# tca
source: $GLOBALS['TCA'] (Table configuration array)
de: $GLOBALS['TCA'] (Array für Tabellenkonfiguration)

# tbeStyles
source: $GLOBALS['TBE_STYLES'] (Skinning Styles)
de: $GLOBALS['TBE_STYLES'] (Oberflächen-Stile)

# beUserTsConfig
source: $GLOBALS['BE_USER']->getTSConfig() (User TSconfig)
de: $GLOBALS['BE_USER']->getTSConfig() (Benutzer-TSconfig)

# beUser
source: $GLOBALS['BE_USER']->uc (User Settings)
de: $GLOBALS['BE_USER']->uc (Benutzereinstellungen)

# usersettings
source: $GLOBALS['TYPO3_USER_SETTINGS'] (User Settings Configuration)
de: $GLOBALS['TYPO3_USER_SETTINGS'] (Konfiguration für Benutzereinstellungen)

# routes
source: Backend Routes
de: Backendrouten

# httpMiddlewareStacks
source: HTTP Middlewares (PSR-15)
de: HTTP-Middleware (PSR-15)

source: Content Security Policy Mutations
de: Content-Security-Policy-Mutationen

source: Sites: TCA configuration
de: Sites: TCA-Konfiguration

source: Sites: YAML configuration
de: Sites: YAML-Konfiguration

source: MFA providers
de: MFA Anbieter

source: Soft Reference Parsers
de: Soft-Referenz-Parser

# toolbarItems
source: Backend Toolbar Items
de: Backend Toolbar Elemente

source: Form: YAML Configuration
de: Formular: YAML-Konfiguration

# t3services
source: $GLOBALS['T3_SERVICES'] (Registered Services)
de: $GLOBALS['T3_SERVICES'] (Registrierte Dienste)

source: Backend Modules
de: Backend-Module

# pagesTypes
source: Table permissions per page type
de: Tabellenberechtigungen pro Seitentyp

# module.dbint.shortDescription
source: Database integrity check
de: Datenbankintegritätsprüfung

# module.dbint.description
source: Here you can check the integrity of the database tables configured by the $TCA. For instance all records must belong to a page record. You can also get a view of the total pagetree including deleted pages. Finally you've got access to a global database search facility.
de: Hier kannst du die Integrität der von $TCA konfigurierten Datenbanktabellen überprüfen. Zum Beispiel müssen alle Datensätze zu einem Seitendatensatz gehören. Du kannst dir auch einen Überblick über den gesamten Seitenbaum verschaffen, einschließlich der gelöschten Seiten. Und du hast Zugang zu einer globalen Datenbank-Suchfunktion.

# module.dbint.docheader.viewmode
source: Module action
de: Modul-Aktion

# search.placeholder
source: Search Word
de: Suchbegriff

# search.submit
source: Search All Records
de: Alle Datensätze durchsuchen

source: Search
de: Suchen

source: Record Statistics
de: Datensatz-Statistik

source: Total Page Tree
de: Gesamter Seitenbaum

source: Database Relations
de: Datenbankrelationen

source: Full search
de: Volltextsuche

source: Find filename
de: Dateinamen finden

# manageRefIndex
source: Manage Reference Index
de: Referenz-Index verwalten

# rawSearch
source: Raw search in all fields
de: Suche in allen Feldern

source: Advanced query
de: Erweiterte Abfrage

source: Select records
de: Datensätze auswählen

source: Count results
de: Ergebnisse zählen

source: Explain query
de: Anfrage erläutern

# clickToUpdateRefIndex
source: Click here to update reference index
de: Klicken Sie hier, um den Referenz-Index zu aktualisieren:

source: Update now!
de: Jetzt aktualisieren!

# clickToTestRefIndex
source: Click here to test reference index
de: Klicken Sie hier, um den Referenz-Index zu prüfen:

# referenceIndex_description
source: TYPO3's reference index keeps track of the relations between records. As it can happen that the reference index contains outdated values, you can check and update it here.
de: Der TYPO3-Referenzindex zeichnet Beziehungen zwischen Datensätzen auf. Da es vorkommen kann, dass Werte veralten, gibt es hier die Möglichkeit, ihn zu prüfen und aktualisieren.

# referenceIndex_buttonUpdate
source: Update reference index
de: Referenzindex aktualisieren

# referenceIndex_buttonCheck
source: Check reference index
de: Referenzindex prüfen

source: Check now!
de: Jetzt prüfen!

# checkScript_headline
source: Using the command line interface
de: Verwendung der Kommandozeile

# checkScript
source: You can also run the check as a shell script using CLI if the processing takes longer than the PHP max_execution_time allows.
de: Sie können die Prüfung auch in einem Shell-Script mit dem Command Line Interface (CLI) durchführen, wenn die Verarbeitung länger braucht, als die max_execution_time in PHP erlaubt.

# checkScript_check_description
source: To check the reference index use:
de: Um den Referenz-Index zu prüfen, führen Sie folgenden Befehl aus:

# checkScript_update_description
source: To update the reference index use:
de: Um den Referenz-Index zu aktualisieren, führen Sie folgenden Befehl aus:

# checkScript_moreDetails
source: For more details see:
de: Für weitere Details siehe:

# updateRefIndex
source: Update reference index
de: Referenzindex aktualisieren

# showSQL
source: Show SQL parts
de: SQL-Teile anzeigen

# useFormattedStrings
source: Use formatted strings, labels and dates instead of original values for results
de: Formatierte Strings, Labels und Datumsangaben statt der Originalwerte im Ergebnis anzeigen

# dontUseOrigValues
source: Don't use original values in brackets as prefix for labelled results
de: Originalwerte in Klammern nicht als Präfix für Ergebnisse mit Label verwenden

# sortOptions
source: Sort selectbox-options for relations by label and not by value
de: Auswahlfeldoptionen für Relationen nach Label und nicht nach Wert sortieren

# showDeleted
source: Show even deleted entries (with undelete buttons)
de: Auch gelöschte Einträge anzeigen (mit Wiederherstellen-Schaltfläche)

source: Search options
de: Suchoptionen:

source: Result
de: Ergebnis:

# no_results
source: No results found for "%s".
de: Keine Ergebnisse für „%s“ gefunden.

# no_sword
source: Enter a search term to search for records
de: Geben Sie einen Suchbegriff ein, um nach Datensätzen zu suchen

source: Tables
de: Tabellen:

source: references
de: Referenzen:

source: is missing!
de: fehlt!

source: Referenced from
de: Referenziert von:

source: Enter regex pattern
de: Muster für regulären Ausdruck eingeben:

# searchButton
source: Search
de: Suchen

source: Pattern
de: Muster

source: being checked...
de: wird geprüft...

# directories
source: Dirs
de: Verzeichnisse:

# directoriesTooDeep
source: ERROR: Directories deeper than the following number of levels
de: FEHLER: Verzeichnisse tiefer verschachtelt als folgende Anzahl Ebenen:

source: Files
de: Dateien:

source: Matching files
de: Gefundene Dateien:

source: not checked.
de: nicht geprüft.

source: Searching for filenames
de: Suche nach Dateinamen:

# fixLostRecord
source: Click to move this lost record to rootlevel (pid=0)
de: Klicken, um diesen verwaisten Eintrag an die Wurzel zu verschieben (pid=0)

# doktype
source: Document types
de: Seitentypen:

# doktype_value
source: Document types (value)
de: Dokumenttypen (Wert)

source: Pages
de: Seiten:

# total_pages
source: Total number of default language pages
de: Gesamtzahl der Seiten

# translated_pages
source: Total number of translated pages
de: Gesamtanzahl übersetzter Seiten

# deleted_pages
source: Marked-deleted pages
de: Als gelöscht markierte Seiten:

source: Hidden pages
de: Verborgene Seiten:

source: Count
de: Anzahl

source: Table name
de: Tabellenname

# total_lost
source: Records total / lost
de: Datensätze insgesamt/verloren

source: Relations
de: Verknüpfungen

# relations_description
source: The module gives some overview of missing relations in fields of the TCA types 'select' and 'group'.
de: Das Modul gibt einen Überblick über fehlende Beziehungen in den Feldern der TCA-Typen 'select' und 'group'.

# relations_noRecordsFound
source: No records found.
de: Keine Datensätze gefunden.

# select_db
source: Select fields
de: Auswahlfelder:

# group_db
source: Group fields
de: Gruppenfelder:

# tree
source: The Page Tree
de: Der Seitenbaum:

# tree_description
source: This shows all pages in the system in one large tree. Beware that this will probably result in a very long document which will also take some time for the server to compute!
de: Hier werden alle Seiten im System in einem großen Seitenbaum angezeigt. Beachten Sie, dass das Ergebnis wahrscheinlich ein sehr großes Dokument ist und der Server einige Zeit brauchen kann, um es zu erstellen.

# records
source: Records Statistics
de: Statistik der Datenbank-Einträge

# records_description
source: This shows some statistics for the records in the database. This runs through the entire page-tree and therefore it will also load the server heavily!
de: Zeigt statistische Daten zu den Einträgen in der Datenbank an. Hierzu wird der komplette Seitenbaum durchsucht, der Server wird entsprechend stark belastet!

source: Search whole Database
de: Gesamte Datenbank durchsuchen

# search_description
source: This searches through all database tables and records for a text string.
de: Durchsucht alle Datenbank-Tabellen und Einträge nach einem Text.

# refindex
source: Check and update global reference index
de: Globalen Referenz-Index prüfen und aktualisieren

# refindex_description
source: Allows you to maintain the reference index kept by TYPO3.
de: Ermöglicht die Pflege des von TYPO3 verwalteten Referenz-Index.

# refindex_ok
source: Index integrity was perfect!
de: Index-Integrität war perfekt!
