Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/indexed_search/Resources/Private/Language/*.locallang.xlf
Languages: de

# localizedOperandAnd
source: AND
de: UND

# localizedOperandOr
source: OR
de: ODER

# localizedOperandNot
source: NOT
de: NICHT

# rules.headline
source: Rules
de: Regeln

# rules.text
source: Only words with 2 or more characters are accepted<br /> Max 200 chars total<br /> Space is used to split words, "" can be used to search for a whole string (not indexed search then)<br /> AND, OR and NOT are prefix words, overruling the default operator<br /> +/|/- equals AND, OR and NOT as operators.<br /> All search words are converted to lowercase.
de: Nur Wörter mit 2 oder mehr Zeichen werden akzeptiert.<br /> Maximal 200 Zeichen insgesamt.<br /> Leerzeichen werden zur Trennung von Worten verwendet, "" kann für die Suche nach ganzen Zeichenfolgen benutzt werden (keine Indexsuche).<br /> UND, ODER und NICHT sind Suchoperatoren, die den standardmäßigen Operator überschreiben.<br /> +/|/- entspricht UND, ODER und NICHT als Operatoren.<br /> Alle Suchbegriffe werden in Kleinschreibung umgewandelt.

# form.legend
source: Search form
de: Suchformular

# form.searchFor
source: Search for
de: Suchen nach

# form.extResume
source: Extended resume
de: Erweiterte Vorschau

# form.atATime
source: at a time
de: gleichzeitig

# form.orderBy
source: Order by
de: Sortieren nach

# form.fromSection
source: From section
de: Aus dem Bereich

# form.freeIndexUid
source: Category
de: Kategorie

# form.searchIn
source: Search in
de: Suche in

# form.match
source: Match
de: Vergleich

# form.style
source: Style
de: Ansicht

# form.submit
source: Search
de: Suchen

# form.addToSearch
source: Add to current search words
de: Den derzeitigen Suchbegriffen hinzufügen

# form.linkToRegularSearch
source: Regular search
de: Normale Suche

# form.linkToAdvancedSearch
source: Advanced search
de: Erweiterte Suche

# searchTypes.0
source: Distinct word
de: Ganzes Wort

# searchTypes.1
source: Part of word
de: Wortteil

# searchTypes.2
source: First part of word
de: Wortanfang

# searchTypes.3
source: Last part of word
de: Wortende

# searchTypes.10
source: Sounds like
de: Aussprache

# searchTypes.20
source: Sentence
de: Ganzer Satz

# defaultOperands.0
source: All words (AND)
de: Alle Wörter (UND)

# defaultOperands.1
source: Any words (OR)
de: Jedes Wort (ODER)

# languageUids.-1
source: All languages
de: Alle Sprachen

# languageUids.0
source: Default
de: Standard

# sections.0
source: Whole site
de: Ganze Website

# sections.-1
source: Only this page
de: Nur diese Seite

# sections.-2
source: Top + level 1
de: Homepage + Ebene 1

# sections.-3
source: Level 2 and out
de: Ebene 2 und tiefer

# sections.rootLevel1
source: Level 1
de: Ebene 1:

# sections.rootLevel1All
source: All pages on level 1
de: Alle Seiten auf Ebene 1

# sections.rootLevel2
source: - Level 2
de: - Ebene 2:

# sections.rootLevel2All
source: - All pages on level 2
de: - Alle Seiten auf Ebene 2

# mediaTypes.0
source: Internal pages
de: Interne Seiten

# mediaTypes.-1
source: All media
de: Alle Medien

# mediaTypes.-2
source: All External
de: Alle externen Seiten

# indexingConfigurations.-1
source: All, mixed
de: Alle, gemischt

# indexingConfigurations.-2
source: All, categorized
de: Alle, kategorisiert

# indexingConfigurations.0
source: Pages
de: Seiten

# indexingConfigurationHeader.-1
source: Mixed categories
de: gemischte Kategorien

# indexingConfigurationHeader.0
source: Website Pages
de: Web-Seiten

# sortOrders.rank_flag
source: Weight/Frequency
de: Trefferquote/Vorkommen

# sortOrders.rank_freq
source: Frequency
de: Vorkommen

# sortOrders.rank_first
source: Close to top
de: Nähe zum Dokumentanfang

# sortOrders.rank_count
source: Number of words
de: Anzahl der Worte

# sortOrders.mtime
source: Date Modified
de: Letzte Änderung

# sortOrders.title
source: Document title
de: Dokumententitel

# sortOrders.crdate
source: Creation date
de: Erstelldatum

# sortOrders.descending
source: Highest first
de: Höchste zuerst

# sortOrders.ascending
source: Lowest first
de: Geringste zuerst

# groupBy.sections
source: Section hierarchy
de: Bereichshierarchie

# groupBy.flat
source: Flat list
de: Flache Liste

# result.page
source: page
de: Seite

# result.pages
source: pages
de: Seiten

# result.unnamedSection
source: Other
de: Andere

# result.otherMatching
source: Other matching pages in the same document
de: Andere passende Seiten im selben Dokument:

# result.otherPageAsWell
source: INFO: There was another page indexed as well. Probably indexed with another or no usergroup.
de: Information: Eine andere Seite wurde auch indexiert... Diese wurde vermutlich mit einer anderen oder keiner Benutzergruppe indexiert.

# result.path
source: Path
de: Pfad:

# result.modified
source: Modified
de: Geändert:

# result.created
source: Created
de: Erstellt:

# result.size
source: Size
de: Größe:

# result.noResume
source: Note: This search hit may not accurately match the content on this page. The page resume cannot be shown.
de: Hinweis: Der Inhalt dieser Seite entspricht nicht exakt der Suche. Die Seitenvorschau wird nicht angezeigt.

# result.memberGroups
source: Require membership of group numbers %s
de: Erfordert Mitgliedschaft der Gruppe(n) Nummer %s

# result.ratingMatches
source: matches
de: Treffer

# result.noResult
source: No results found.
de: Keine Ergebnisse gefunden.

# result.inSection
source: in the section
de: im Bereich

# result.inNsection
source: in %s section
de: in %s Bereich:

# result.inNsections
source: in %s sections
de: in %s Bereichen:

source: Search for
de: Suchen nach

# searchFor.or
source: or
de: oder

# searchFor.and
source: and
de: und

# searchFor.andnot
source: but not
de: aber nicht

# displayResults.previous
source: < Previous
de: < Zurück

# displayResults.page
source: Page
de: Seite

# displayResults.next
source: Next >
de: Nächste >

# displayResults
source: Displaying results <strong>%1$s to %2$s</strong> out of <strong>%3$s</strong>
de: Anzeige der Ergebnisse <strong>%1$s bis %2$s</strong> von insgesamt <strong>%3$s</strong>

# administration.menu.general
source: General statistics
de: Allgemeine Statistiken

# administration.menu.pages
source: List: Pages
de: Liste: Seiten

# administration.menu.externalDocuments
source: List: External documents
de: Liste: Externe Dokumente

# administration.menu.searchStatistic
source: Search statistics
de: Suchstatistik

# administration.menu.statistic
source: Detailed statistics
de: Detaillierte Statistik

# administration.index.description
source: General statistics
de: Allgemeine Statistiken

# administration.statistics
source: Indexing Engine Statistics
de: Statistiken zur Indizierung

# administration.statistics.header
source: Row count by database table
de: Zeilenanzahl pro Datenbanktabelle

# administration.statistics.count
source: Count
de: Anzahl

# administration.statistics.headerTypes
source: Hash Header Types
de: Hash-Headertypen

# administration.statistics.headerTypes.count
source: Count / Unique count
de: Anzahl / Einmalige Anzahl

# administration.statistics.word
source: Word
de: Wort

# administration.statistics.mostSearched.title
source: List of most searched words
de: Liste der meist-gesuchten Worte

# administration.statistics.mostSearched.description
source: Statistics for all pages. Select a page with indexed search form to see several statistics.
de: Statistiken für alle Seiten. Wählen Sie eine Seite mit Indexsuchformular aus, um detaillierte Statistiken zu sehen.

# administration.statistics.mostSearched.all
source: All
de: Alle

# administration.statistics.mostSearched.last30days
source: Last 30 days
de: Letzte 30 Tage

# administration.statistics.mostSearched.last24hours
source: Last 24 hours
de: Letzte 24 Stunden

# administration.statistics.noResult
source: No result found
de: Kein Ergebnis gefunden

# administration.statistics.noResultForPage
source: No result for the selected page found.
de: Kein Ergebnis für die ausgewählte Seite gefunden.

# administration.statistics.selectPage
source: Please select a page in the page tree.
de: Bitte wählen Sie eine Seite aus dem Seitenbaum aus.

# administration.external.title
source: External documents
de: Externe Dokumente

# field.fileName
source: Filename
de: Dateiname

# field.fileSize
source: Filesize
de: Dateigröße

# field.wordCount
source: Word count
de: Wortanzahl

# field.words
source: Words
de: Worte

# field.mtime
source: Modification time
de: Bearbeitungszeit

# field.indexed
source: Indexed
de: Indiziert

# field.updated
source: Updated
de: Aktualisiert

# field.parseTime
source: Parsetime [ms]
de: Parsezeit [ms]

# field.sub
source: Sub
de: Unter

# field.staticPageArguments
source: Static Page Arguments
de: Statische Seitenargumente

# field.count
source: Count
de: Anzahl

# field.first
source: First
de: Erster

# field.pHash
source: PageHash
de: SeitenHash

# field.path
source: Path
de: Pfad:

# field.id
source: Page Id
de: Seiten-ID

# field.uniqueId
source: Unique Id
de: Eindeutige ID

# field.type
source: Type
de: Typ

# field.title
source: Title
de: Titel

# field.language
source: Language
de: Sprache

# field.frequency
source: Frequency
de: Vorkommen

# field.flag
source: Flag
de: Markierung

# field.content
source: Content
de: Inhalt

# administration.notIndexed
source: Not indexed?
de: Nicht indiziert?

# administration.document.description
source: Details for a single result row
de: Details für eine einzelne Ergebniszeile

# administration.document.words
source: All words found on page
de: Alle Worte auf Seite

# administration.document.topCount
source: Words by top count
de: Worte nach Anzahl

# administration.document.topFrequency
source: Words by frequency
de: Worte nach Frequenz

# administration.stopWords
source: Stopwords
de: Stoppworte

# administration.stopWords.save
source: Save stopwords
de: Stoppworte speichern

# administration.keywords
source: Page keywords
de: Seitenstichworte

# administration.keywords.current
source: Current page keywords
de: Aktuelle Seitenstichworte

# administration.stopWordsKeywords.save
source: Save keywords and stop words
de: Stoppworte und Schlüsselworte speichern

# administration.word.description
source: Detail view of a single word
de: Detailansicht eines einzelnen Wortes

# administration.linkBack
source: Back
de: Zurück

# administration.statistics.sectionRecords
source: Section records for this phash
de: Abschnittsdatensätze für diesen Phash

# administration.statistics.view.overview
source: Overview
de: Überblick

# administration.statistics.view.content
source: Words and content
de: Worte und Inhalt

# administration.phash.tableHeader
source: Phash row content
de: Inhalt der Phash-Zeile

# administration.removeEntry
source: Remove entry
de: Eintrag entfernen

# administration.removeAllEntries
source: Remove all listed entries
de: Alle aufgeführten Einträge entfernen

# administration.back
source: Back
de: Zurück

# administration.noPageSelected
source: Please select a page from the page tree.
de: Bitte wählen Sie eine Seite aus dem Seitenbaum aus.

# administration.moduleFunctions.mode
source: Mode
de: Modus

# administration.moduleFunctions.depth
source: Depth
de: Tiefe

# error.noTypoScript
source: Error: Please check that TypoScript for the Indexed Search plugin is included.
de: Fehler: Bitte stellen Sie sicher, dass das TypoScript für das Indexsuche-Plug-In eingebunden ist.
