Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_password_policy.xlf
Languages: de

# passwordRequirements.description
source: The password must match the following requirements:
de: Das Passwort muss den folgenden Anforderungen entsprechen:

# requirement.minimumLength
source: Minimum length: %d chars
de: Minimale Länge: %d Zeichen

# requirement.upperCaseCharacterRequired
source: At least one upper case char
de: Mindestens ein Großbuchstabe

# requirement.lowerCaseCharacterRequired
source: At least one lower case char
de: Mindestens ein Kleinbuchstabe

# requirement.digitCharacterRequired
source: At least one digit
de: Mindestens eine Ziffer

# requirement.specialCharacterRequired
source: At least one special char
de: Mindestens ein Sonderzeichen

# requirement.notCurrentPassword
source: Must be different from current password
de: Muss sich vom aktuellen Passwort unterscheiden

# error.minimumLength
source: The password is too short. Minimum length is %d chars
de: Das Passwort ist zu kurz. Die Mindestlänge beträgt %d Zeichen

# error.upperCaseCharacterRequired
source: The password must at least contain one upper case char
de: Das Passwort muss mindestens einen Großbuchstaben enthalten

# error.lowerCaseCharacterRequired
source: The password must at least contain one lower case char
de: Das Passwort muss mindestens einen Kleinbuchstaben enthalten

# error.digitCharacterRequired
source: The password must at least contain one digit
de: Das Passwort muss mindestens eine Ziffer enthalten

# error.specialCharacterRequired
source: The password must at least contain one special char
de: Das Passwort muss mindestens ein Sonderzeichen enthalten

# error.notCurrentPassword
source: The password must be different from the old password
de: Das Passwort muss sich vom alten Passwort unterscheiden

# dataHandler.passwordNotSaved
source: Password not saved ({table}:{uid}):
de: Passwort wurde nicht gespeichert ({table}:{uid}):
