Repository: oliverklee/TYPO3-testing-distribution
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_mfa_provider.xlf
Languages: de

# totp.title
source: Time-based one-time password
de: Zeitbasiertes Einmalkennwort

# totp.description
source: This provider allows to authenticate with a single-use passcode which is based on the current time. Each code is only valid for 30 seconds. You need a OTP application or device, supporting such tokens.
de: Dieser Provider erlaubt die Authentifizierung mit einem Einwegpasscode, der auf der aktuellen Zeit basiert. Jeder Code ist nur für 30 Sekunden gültig. Sie benötigen eine OTP-Anwendung oder ein Gerät, welches solche Token unterstützt.

# totp.setupInstructions
source: The time-based one-time password provider enables you to strengthen your accounts' security by requiring a six-digit code on every login. This provider is based on a shared secret, which will be exchanged between your OTP application (or device) and TYPO3. Each code takes the current time into account and is only valid for 30 seconds. Setting up: 1. Scan the QR-code or directly enter the shared secret in your application or device 2. Add a specific name for this provider (optional) 3. Enter the generated six-digit code in the corresponding field 4. Submit the form to activate the provider Note: In case your application supports otpauth:// urls, you can retrieve the url by clicking on the info button next to the shared secret.
de: Der zeitbasierte einmalige Passwort-Provider ermöglicht es Ihnen, die Sicherheit Ihrer Konten zu verbessern, indem Sie bei jedem Login einen sechsstelligen Code benötigen. Dieser Provider basiert auf einem Code, der zwischen Ihrer OTP-Anwendung (oder Ihrem Gerät) und TYPO3 ausgetauscht wird. Jeder Code berücksichtigt die aktuelle Zeit und ist nur für 30 Sekunden gültig. Einrichtung: 1. Scannen Sie den QR-Code oder geben Sie den Code direkt in Ihrer Anwendung oder Ihrem Gerät ein 2. Fügen Sie einen speziellen Namen für diesen Anbieter hinzu (optional) 3. Geben Sie den generierten sechsstelligen Code in das entsprechende Feld ein 4. Schicken Sie das Formular zur Aktivierung des Anbieters ab Hinweis: Falls Ihre Anwendung otpauth:// Urls unterstützt, können Sie die URL abrufen, indem Sie auf den Info-Button neben dem geteilten Code klicken.

# recoveryCodes.title
source: Recovery codes
de: Wiederherstellungscodes

# recoveryCodes.description
source: This provider allows to authenticate with a set of single-use passcodes, in case you lost your primary MFA credentials, or just have no access to them temporarily.
de: Dieser Provider erlaubt die Authentifizierung mit einer Reihe von Einweg-Passcodes, für den Fall, dass Sie Ihre primären MFA-Anmeldedaten verloren haben oder einfach nur vorübergehend keinen Zugriff darauf haben.

# recoveryCodes.setupInstructions
source: Recovery codes are random eight-digit codes which can be used to authenticate, in case your lost your main authentication credentials. Each code is only valid once. As soon as all recovery codes are exhausted, you're required to generate a new set. Therefore, periodically check the amount of remaining codes in the Edit / Change view of the provider. Setting up: 1. Copy the recovery codes and store them at a safe place 2. Add a specific name for this provider (optional) 3. Submit the form to activate the provider - see below note Note: Since the recovery codes are being encrypted and stored securely, this process can take some time.
de: Wiederherstellungscodes sind zufällige achtstellige Codes, die zur Authentifizierung verwendet werden können, falls Sie Ihre primären Authentifizierungsdaten verloren haben. Jeder Code ist nur einmal gültig. Sobald alle Wiederherstellungscodes erschöpft sind, müssen Sie einen neuen Satz generieren. Überprüfen Sie daher regelmäßig die Anzahl der verbleibenden Codes in der Ansicht Bearbeiten / Ändern des Anbieters. Einrichten: 1. Kopieren Sie die Wiederherstellungscodes und bewahren Sie sie an einem sicheren Ort auf 2. Fügen Sie einen bestimmten Namen für diesen Anbieter hinzu (optional) 3. Senden Sie das Formular ab, um den Anbieter zu aktivieren - siehe Hinweis unten Hinweis: Da die Wiederherstellungscodes verschlüsselt und sicher gespeichert werden, kann dieser Vorgang einige Zeit in Anspruch nehmen.

# totpInputLabel
source: Enter the generated six-digit code
de: Geben Sie den generierten 6-stelligen Code ein

# totpInputHelp
source: This code should now be displayed on your device or in your application.
de: Dieser Code sollte nun auf Ihrem Gerät oder in Ihrer Anwendung angezeigt werden.

# locked
source: The maximum attempts for this provider are exceeded. Please use another provider or contact your administrator.
de: Die maximale Anzahl Versuche für diesen Provider wurden überschritten. Bitte verwenden Sie einen anderen Anbieter oder kontaktieren Sie Ihren Administrator.

# edit.table.nameInputPlaceholder
source: Enter a name
de: Name eingeben

# edit.table.recoveryCodesLeft
source: Recovery codes left
de: Verbleibende Wiederherstellungscodes

# edit.table.lastUsed
source: Last used
de: Zuletzt verwendet

# edit.table.lastUsed.default
source: Never
de: Nie

# edit.table.lastUpdated
source: Last updated
de: Zuletzt aktualisiert

# edit.regenerate
source: Regenerate recovery codes
de: Wiederherstellungscodes neu generieren

# edit.regenerate.description
source: If you lost your recovery codes or just want to get fresh ones, you can regenerate them by selecting the checkbox below. You've currently %d codes left.
de: Wenn Sie Ihre Wiederherstellungscodes verloren haben, oder einfach neue generieren wollen, können Sie dies durch Auswahl der Schaltfläche unterhalb tun. Derzeit sind %d Wiederherstellungscodes verbleibend.

# edit.regenerate.inputLabel
source: Regenerate recovery codes
de: Wiederherstellungscodes neu generieren

# setup.step.1
source: Step 1
de: Schritt 1

# setup.step.1a
source: Step 1a
de: Schritt 1a

# setup.step.1b
source: Step 1b
de: Schritt 1b

# setup.step.2
source: Step 2
de: Schritt 2

# setup.step.3
source: Step 3
de: Schritt 3

# setup.qrCode.label
source: Scan the displayed QR code
de: Scannen Sie den angezeigten QR-Code

# setup.qrCode.help
source: Scan this code with your OTP application (e.g. Google Authenticator).
de: Scannen Sie diesen Code mit Ihrer OTP-Anwendung (z.B. Google Authenticator).

# setup.secret.label
source: Copy the shared secret
de: Geteilten Code kopieren

# setup.secret.help
source: You can also enter the shared secret manually in your OTP application or device.
de: Sie können den geteilten Code auch manuell in Ihrer OTP-Anwendung oder Ihrem Gerät eingeben.

# setup.name.label
source: Enter a name (optional)
de: Name eingeben (optional)

# setup.name.help
source: Specify a custom name for this provider.
de: Geben Sie einen benutzerdefinierten Namen für diesen Anbieter an.

# setup.recoveryCodes.InputLabel
source: Recovery codes
de: Wiederherstellungscodes

# setup.recoveryCodes.InputHelp
source: Copy these codes and store them at a safe place.
de: Kopieren Sie die Codes und speichern Sie diese an einem sicheren Ort.

# setup.recoveryCodes.reloadTitle
source: Reload recovery codes
de: Wiederherstellungscodes neu laden

# setup.recoveryCodes.reloadLabel
source: Reload
de: Neu laden

# setup.recoveryCodes.noActiveProviders.title
source: Setup not possible
de: Einrichtung nicht möglich

# setup.recoveryCodes.noActiveProviders.message
source: Recovery codes are only meant as a fallback if you lose access to your main multi-factor authentication credentials. Therefore, please activate a comprehensive MFA provider first.
de: Wiederherstellungscodes sind nur dann als Fallback gedacht, wenn Sie den Zugriff auf Ihre primären Multi-Faktor Authentifizierungsdaten verlieren. Bitte aktivieren Sie daher zuerst einen umfassenden MFA-Provider.

# setup.totpAuthUrlButton.title
source: Show authentication URL
de: Authentifizierungs-URL anzeigen

# setup.totpAuthUrlModal.title
source: Authentication URL
de: Authentifizierungs-URL

# setup.totpAuthUrlModal.description
source: In case you are not able to scan the QR code, but your OTP application supports authentication URLs next to, or instead of plain shared secrets, you can copy and paste the URL shown below. The URL contains some information like the issuer (this site) and your email address or username. Most OTP applications will display this information next to the generated codes.
de: Falls Sie den QR-Code nicht scannen können, aber Ihre OTP-Anwendung Authentifizierungs-URLs neben oder statt einfacher geteilter Codes unterstützt, können Sie die unten angezeigte URL kopieren und einfügen. Die URL enthält einige Informationen wie z. B. den Aussteller (dieser Seite) und Ihre E-Mail-Adresse oder Ihren Benutzernamen. Die meisten OTP-Anwendungen werden diese Informationen neben den generierten Codes anzeigen.

# auth.totp.inputLabel
source: Enter the six-digit code
de: 6-stelligen Code eingeben

# auth.recoveryCodes.inputLabel
source: Enter an eight-digit recovery code
de: Geben Sie einen achtstelligen Wiederherstellungscode ein

# unlock.recoveryCodes.title
source: Your recovery codes were automatically updated!
de: Ihre Wiederherstellungscodes wurden automatisch aktualisiert!

# unlock.recoveryCodes.message
source: Please copy and store them at a safe place: %s
de: Bitte kopieren und sicher aufbewahren: %s

# unlock.recoveryCodes.title
source: Recovery codes successfully regenerated
de: Wiederherstellungscodes neu erzeugt
